zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA174/drivers/fsl_clock.c
    /* Freeze clock configuration */
    SYSCON->CLKUNLOCK |= SYSCON_CLKUNLOCK_UNLOCK_MASK;
}

/* Initialize the FROHF to given frequency (45,60,90,180)
 * (80,120,240) are only supported for 240M part */
status_t CLOCK_SetupFROHFClocking(uint32_t iFreq)
{
    uint8_t freq_select       = 0x0U;
    uint8_t need_switch_frohf = 0x0U;
    uint32_t trim_value       = 0x0U;
    switch (iFreq)
    {
        case 45000000U:
            freq_select = 1U;
            trim_value  = IFR1_VAL_180M_TRIM;
            break;
        case 60000000U:
            freq_select = 3U;
            trim_value  = IFR1_VAL_180M_TRIM;
            break;
        case 90000000U:
            freq_select = 5U;
            trim_value  = IFR1_VAL_180M_TRIM;
            break;
        case 180000000U:
            freq_select = 7U;
            trim_value  = IFR1_VAL_180M_TRIM;
            break;
#if FSL_FEATURE_FIRC_SUPPORT_240M
        case 80000000U:
            freq_select = 3U;
            trim_value  = IFR1_VAL_240M_TRIM;
            break;
        case 120000000U:
            freq_select = 5U;
            trim_value  = IFR1_VAL_240M_TRIM;
            break;
        case 240000000U:
            freq_select = 7U;
            trim_value  = IFR1_VAL_240M_TRIM;
            break;
#endif
        default:
            freq_select = 0xFU;
            break;
    }

    if (0xFU == freq_select)
    {
        return kStatus_Fail;
    }

#if FSL_FEATURE_FIRC_SUPPORT_240M
    /* Check if the trim value is valid */
    if (trim_value == 0xFFFFFFFFU)
    {
        return kStatus_Fail;
    }

    /* Load trim value from IFR */
    if (SCG0->FIRCTRIM != trim_value)
    {
        SCG0->TRIM_LOCK = 0x5A5A0001U;
        SCG0->FIRCTRIM = trim_value;
        SCG0->TRIM_LOCK = 0x5A5A0000U;
    }
#else
    (void)trim_value;
#endif

    /* Switch to FRO LF if FRO HF is in use */
    if (0x3U == ((SCG0->CSR & SCG_CSR_SCS_MASK) >> SCG_CSR_SCS_SHIFT))
    {
        need_switch_frohf = 1;
        CLOCK_AttachClk(kFRO12M_to_MAIN_CLK);
    }

    /* Set FIRC frequency */
    SCG0->FIRCCFG = SCG_FIRCCFG_FREQ_SEL(freq_select);

    /* Unlock FIRCCSR */
    SCG0->FIRCCSR &= ~SCG_FIRCCSR_LK_MASK;

    /* Enable CLK 45 MHz clock for peripheral use */
    SCG0->FIRCCSR |= SCG_FIRCCSR_FIRC_SCLK_PERIPH_EN_MASK;
    /* Enable FIRC HF clock for peripheral use */
    SCG0->FIRCCSR |= SCG_FIRCCSR_FIRC_FCLK_PERIPH_EN_MASK;
    /* Enable FIRC */
    SCG0->FIRCCSR |= SCG_FIRCCSR_FIRCEN_MASK;

    /* Lock FIRCCSR */
    SCG0->FIRCCSR |= SCG_FIRCCSR_LK_MASK;

    /* Wait for FIRC clock to be stable. */
    while ((SCG0->FIRCCSR & SCG_FIRCCSR_FIRCACC_MASK) == 0U)
    {
    }

    /* Switch back to FRO HF */
    if (1 == need_switch_frohf)
    {
        CLOCK_AttachClk(kFRO_HF_to_MAIN_CLK);
    }

    return kStatus_Success;
}

/* Initialize the FRO12M. */
status_t CLOCK_SetupFRO12MClocking(void)
{
    /* Unlock SIRCCSR */
    SCG0->SIRCCSR &= ~SCG_SIRCCSR_LK_MASK;

    /* Enable FRO12M clock for peripheral use */
    SCG0->SIRCCSR |= SCG_SIRCCSR_SIRC_CLK_PERIPH_EN_MASK;

    /* Lock SIRCCSR */
    SCG0->SIRCCSR |= SCG_SIRCCSR_LK_MASK;

    /* Wait for SIRC clock to be valid. */
    while ((SCG0->SIRCCSR & SCG_SIRCCSR_SIRCVLD_MASK) == 0U)
    {
    }

    /* Release FROLFDIV */
    SYSCON->FROLFDIV &= ~SYSCON_FROLFDIV_HALT_MASK;

    return kStatus_Success;
}

/*!
 * brief   Initialize the FRO16K.
 * This function turns on FRO16K.
 * return  returns success or fail status.
 */
status_t CLOCK_SetupFRO16KClocking(uint8_t clk_16k_enable_mask)
{
    /* Enable clk_16k */
    VBAT0->FROCTLA |= VBAT_FROCTLA_FRO_EN_MASK;
    VBAT0->FROLCKA |= VBAT_FROLCKA_LOCK_MASK;

    /* Enable clk_16k output clock to corresponding modules according to the
     * enable_mask. */
    VBAT0->FROCLKE |= VBAT_FROCLKE_CLKE(((uint32_t)clk_16k_enable_mask));

    return kStatus_Success;
}

/*!
 * brief   Initialize the external osc clock to given frequency.
 * param   iFreq   : Desired frequency (must be equal to exact rate in Hz)
 * return  returns success or fail status.
 */
status_t CLOCK_SetupExtClocking(uint32_t iFreq)
{
    uint8_t range = 0U;

    if ((iFreq >= 8000000U) && (iFreq < 16000000U))
    {
        range = 0U;
    }
    else if ((iFreq >= 16000000U) && (iFreq < 25000000U))
    {
        range = 1U;
    }
    else if ((iFreq >= 25000000U) && (iFreq < 40000000U))
    {
        range = 2U;
    }
    else if ((iFreq >= 40000000U) && (iFreq <= 50000000U))
    {
        range = 3U;
    }
    else
    {
        return kStatus_InvalidArgument;
    }

    /* If configure register is locked, return error. */
    if ((SCG0->SOSCCSR & SCG_SOSCCSR_LK_MASK) != 0U)
    {
        return kStatus_ReadOnly;
    }

    /* De-initializes the SCG SOSC */
    SCG0->SOSCCSR = SCG_SOSCCSR_SOSCERR_MASK;

    /* Enable LDO */
    SCG0->LDOCSR |= SCG_LDOCSR_LDOEN_MASK;

    /* Select SOSC source(internal crystal oscillator) and Configure SOSC range */
    SCG0->SOSCCFG = SCG_SOSCCFG_EREFS_MASK | SCG_SOSCCFG_RANGE(range);

    /* Unlock SOSCCSR */
    SCG0->SOSCCSR &= ~SCG_SOSCCSR_LK_MASK;

    /* Enable SOSC clock monitor and Enable SOSC */
    SCG0->SOSCCSR |= (SCG_SOSCCSR_SOSCCM_MASK | SCG_SOSCCSR_SOSCEN_MASK);

    /* Wait for SOSC clock to be valid. */
    while ((SCG0->SOSCCSR & SCG_SOSCCSR_SOSCVLD_MASK) == 0U)
    {
    }

    s_Ext_Clk_Freq = iFreq;

    return kStatus_Success;
}

/*!
 * @brief   Initialize the external reference clock to given frequency.
 * param   iFreq   : Desired frequency (must be equal to exact rate in Hz)
 * return  returns success or fail status.
 */
status_t CLOCK_SetupExtRefClocking(uint32_t iFreq)
{
    if (iFreq > 50000000U)
    {
        return kStatus_InvalidArgument;
    }

    /* If configure register is locked, return error. */
    if ((SCG0->SOSCCSR & SCG_SOSCCSR_LK_MASK) != 0U)
    {
        return kStatus_ReadOnly;
    }

    /* De-initializes the SCG SOSC */
    SCG0->SOSCCSR = SCG_SOSCCSR_SOSCERR_MASK;

    /* Enable LDO */
    SCG0->LDOCSR |= SCG_LDOCSR_LDOEN_MASK;

    /* Select SOSC source (external reference clock)*/
    SCG0->SOSCCFG &= ~SCG_SOSCCFG_EREFS_MASK;

    /* Unlock SOSCCSR */
    SCG0->SOSCCSR &= ~SCG_SOSCCSR_LK_MASK;

